Revit 2027 API
ParameterTypeId.SteelElemWeldDoubleSurfaceshape Property
 "Double Surface Shape"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemWeldDoubleSurfaceshape { get; }
Public Shared ReadOnly Property SteelElemWeldDoubleSurfaceshape As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemWeldDoubleSurfaceshape {
	ForgeTypeId^ get ();
}
static member SteelElemWeldDoubleSurfaceshape : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace